#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.atlantis_access_log_bucket.data.aws_canonical_user_id.this: Reading...
module.atlantis.data.aws_route53_zone.this[0]: Reading...
module.atlantis.data.aws_iam_policy_document.ecs_tasks: Reading...
module.atlantis.data.aws_iam_policy_document.ecs_tasks: Read complete after 0s [id=1869018895]
module.atlantis.data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.atlantis.data.aws_partition.current: Reading...
data.aws_region.current: Reading...
data.aws_elb_service_account.current: Reading...
module.atlantis.data.aws_partition.current: Read complete after 0s [id=aws]
module.atlantis.data.aws_region.current: Read complete after 0s [id=eu-west-1]
data.aws_elb_service_account.current: Read complete after 0s [id=156460612806]
data.aws_region.current: Read complete after 0s [id=eu-west-1]
data.aws_caller_identity.current: Read complete after 0s [id=377683142715]
module.atlantis_access_log_bucket.data.aws_canonical_user_id.this: Read complete after 1s [id=212e890b8a7707a3dae27fc767a4b85d8f497f9c62fef68e7d2866715cb16857]
module.atlantis.data.aws_route53_zone.this[0]: Read complete after 1s [id=Z3KZRLENI7Y98W]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.atlantis_access_log_bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "atlantis_access_log_bucket_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "LogsLogDeliveryWrite"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::156460612806:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSLogDeliveryWrite"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "bucket-owner-full-control",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSLogDeliveryAclCheck"

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.atlantis.data.aws_iam_policy_document.ecs_task_access_secrets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs_task_access_secrets" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.atlantis.aws_cloudwatch_log_group.atlantis will be created
  + resource "aws_cloudwatch_log_group" "atlantis" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "github-complete"
      + retention_in_days = 7
      + tags              = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
    }

  # module.atlantis.aws_ecs_service.atlantis will be created
  + resource "aws_ecs_service" "atlantis" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + force_new_deployment               = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "github-complete"
      + platform_version                   = "LATEST"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "github-complete"
          + container_port   = 4141
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.atlantis.aws_ecs_task_definition.atlantis will be created
  + resource "aws_ecs_task_definition" "atlantis" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "github-complete"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + task_role_arn            = (known after apply)

      + ephemeral_storage {
          + size_in_gib = 21
        }

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # module.atlantis.aws_iam_role.ecs_task_execution will be created
  + resource "aws_iam_role" "ecs_task_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ssm.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-complete-ecs_task_execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.atlantis.aws_iam_role_policy.ecs_task_access_secrets[0] will be created
  + resource "aws_iam_role_policy" "ecs_task_access_secrets" {
      + id     = (known after apply)
      + name   = "ECSTaskAccessSecretsPolicy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.atlantis.aws_iam_role_policy_attachment.ecs_task_execution["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.atlantis.aws_lb_listener_rule.unauthenticated_access_for_cidr_blocks[0] will be created
  + resource "aws_lb_listener_rule" "unauthenticated_access_for_cidr_blocks" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 10
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + source_ip {
              + values = [
                  + "140.82.112.0/20",
                  + "143.55.64.0/20",
                  + "185.199.108.0/22",
                  + "192.30.252.0/22",
                ]
            }
        }
    }

  # module.atlantis.aws_lb_listener_rule.unauthenticated_access_for_webhook[0] will be created
  + resource "aws_lb_listener_rule" "unauthenticated_access_for_webhook" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 15
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/events",
                ]
            }
        }
    }

  # module.atlantis.aws_route53_record.atlantis[0] will be created
  + resource "aws_route53_record" "atlantis" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "github-complete"
      + type            = "A"
      + zone_id         = "Z3KZRLENI7Y98W"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.atlantis.aws_ssm_parameter.atlantis_github_user_token[0] will be created
  + resource "aws_ssm_parameter" "atlantis_github_user_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/atlantis/github/user/token"
      + tags           = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.atlantis.aws_ssm_parameter.webhook[0] will be created
  + resource "aws_ssm_parameter" "webhook" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/atlantis/webhook/secret"
      + tags           = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.atlantis.random_id.webhook[0] will be created
  + resource "random_id" "webhook" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 64
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.atlantis_access_log_bucket.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.atlantis_access_log_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "atlantis-access-logs-377683142715-eu-west-1"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.atlantis_access_log_bucket.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "all"
          + status = "Enabled"

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }

          + transition {
              + days          = 30
              + storage_class = "ONEZONE_IA"
            }
          + transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }
    }

  # module.atlantis_access_log_bucket.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.atlantis_access_log_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.atlantis_access_log_bucket.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.github_repository_webhook.github_repository_webhook.this[0] will be created
  + resource "github_repository_webhook" "this" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issue_comment",
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
        ]
      + id         = (known after apply)
      + repository = "atlantis-test"
      + url        = (known after apply)

      + configuration {
          + content_type = "application/json"
          + insecure_ssl = false
          + secret       = (sensitive value)
          + url          = (sensitive value)
        }
    }

  # module.atlantis.module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "github-complete.digitalsmithsdev.net"
      + domain_validation_options = [
          + {
              + domain_name           = "github-complete.digitalsmithsdev.net"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "github-complete.digitalsmithsdev.net",
        ]
      + tags                      = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.atlantis.module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.atlantis.module.acm.aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z3KZRLENI7Y98W"
    }

  # module.atlantis.module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = true
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "github-complete"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                   = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "atlantis-alb"
        }

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.atlantis.module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.atlantis.module.alb.aws_lb_listener.frontend_https[0] will be created
  + resource "aws_lb_listener" "frontend_https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS-1-2-2017-01"
      + tags              = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.atlantis.module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "10"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "github-complete"
      + port                               = 4141
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/healthz"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.atlantis.module.atlantis_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group with open port for Atlantis (4141) from ALB, egress ports are all world open"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "github-complete-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id                 = (known after apply)
    }

  # module.atlantis.module.atlantis_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.atlantis.module.atlantis_sg.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "Atlantis"
      + from_port                = 4141
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4141
      + type                     = "ingress"
    }

  # module.atlantis.module.ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + id                 = (known after apply)
      + name               = "github-complete"
      + tags               = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all           = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }

      + default_capacity_provider_strategy {
          + capacity_provider = "FARGATE"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.atlantis.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc                  = true
    }

  # module.atlantis.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id   = (known after apply)
    }

  # module.atlantis.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
    }

  # module.atlantis.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.atlantis.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.atlantis.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id           = (known after apply)
    }

  # module.atlantis.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id           = (known after apply)
    }

  # module.atlantis.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.atlantis.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.atlantis.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.atlantis.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.atlantis.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.atlantis.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.atlantis.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.atlantis.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.atlantis.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.atlantis.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.atlantis.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.atlantis.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.atlantis.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.20.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
    }

  # module.atlantis.module.alb_http_sg.module.sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group with HTTP ports open for specific IPv4 CIDR block (or everybody), egress ports are all world open"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "github-complete-alb-http-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id                 = (known after apply)
    }

  # module.atlantis.module.alb_http_sg.module.sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.atlantis.module.alb_http_sg.module.sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "140.82.112.0/20",
          + "143.55.64.0/20",
          + "144.198.210.254/32",
          + "185.199.108.0/22",
          + "192.30.252.0/22",
        ]
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "2606:50c0::/32",
          + "2a0a:a440::/29",
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.atlantis.module.alb_http_sg.module.sg.aws_security_group_rule.ingress_with_self[0] will be created
  + resource "aws_security_group_rule" "ingress_with_self" {
      + description              = "Ingress Rule"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

  # module.atlantis.module.alb_https_sg.module.sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group with HTTPS ports open for specific IPv4 CIDR block (or everybody), egress ports are all world open"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "github-complete-alb-https-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "github-complete"
          + "Owner"       = "claird"
          + "Project"     = "xrp"
        }
      + vpc_id                 = (known after apply)
    }

  # module.atlantis.module.alb_https_sg.module.sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.atlantis.module.alb_https_sg.module.sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "140.82.112.0/20",
          + "143.55.64.0/20",
          + "144.198.210.254/32",
          + "185.199.108.0/22",
          + "192.30.252.0/22",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "2606:50c0::/32",
          + "2a0a:a440::/29",
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.atlantis.module.alb_https_sg.module.sg.aws_security_group_rule.ingress_with_self[0] will be created
  + resource "aws_security_group_rule" "ingress_with_self" {
      + description              = "Ingress Rule"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

Plan: 57 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + atlantis_repo_allowlist = [
      + "github.com/cwlaird3/atlantis-test",
    ]
  + atlantis_url            = (known after apply)
  + ecs_task_definition     = (known after apply)
  + github_webhook_secret   = (sensitive value)
  + github_webhook_urls     = [
      + (known after apply),
    ]
  + task_role_arn           = (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "certificate_arn" but a
value was found in file "terraform.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Argument is deprecated

  with module.atlantis.data.aws_iam_policy_document.ecs_task_access_secrets_with_kms,
  on ../../main.tf line 568, in data "aws_iam_policy_document" "ecs_task_access_secrets_with_kms":
 568:   source_json = data.aws_iam_policy_document.ecs_task_access_secrets.json

Use the attribute "source_policy_documents" instead.

(and 4 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/atlantis_access_log_bucket/main.tf line 27, in resource "aws_s3_bucket" "this":
  27:       acceleration_status,

The attribute "acceleration_status" is deprecated. Refer to the provider
documentation for details.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @cwlaird3, Action: `pull_request`*